update contribution guide
